ДСУтест/src/Documents/ПриходДенежныхСредств/ПриходДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ОстаткиПоСчетам</registerRecords>
  <registerRecords>AccumulationRegister.ДолговыеОбязательства</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должник</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьВСтруктуреДоходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

ДСУтест/src/AccumulationRegisters/ОстаткиПоСчетам/ОстаткиПоСчетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоСчетам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУчетн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДСУтест/src/AccumulationRegisters/ДолговыеОбязательства/ДолговыеОбязательства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДолговыеОбязательства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Должник</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДСУтест/src/Documents/ПриходДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаЗаполнения(Основание)
	
	Валюта = Константы.ОсновнаяВалютаУчёта.Получить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	УчётнаяСумма = Сумма*Курс/Кратность;	
	// проведение по регистру "Остатки по счетам"
	
	ДвижениеОстатки = Движения.ОстаткиПоСчетам.ДобавитьПриход();
	ЗаполнитьЗначенияСвойств(ДвижениеОстатки, Ссылка);
	ДвижениеОстатки.СуммаУчетн = УчётнаяСумма;
	ДвижениеОстатки.Период = Дата;
	
	УчётДоходы = Не (Счет.Забалансовый Или НеУчитыватьВСтруктуреДоходов);
	УчётДолговыеОбязательства = (Не Счет.Забалансовый) И ЗначениеЗаполнено(Должник);
	
	Если УчётДоходы Тогда  // для забалансовых счетов нет смысла считать расходы, нужно только контролировать остатки
		
		// проведение по регистру "Доходы"
		ДвижениеДоходы = Движения.Доходы.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеДоходы, Ссылка);
		ДвижениеДоходы.СуммаУчетн = УчётнаяСумма;
		ДвижениеДоходы.Период = Дата;
		
	КонецЕсли;
	
	// формируем движения по регистру "Долговые обязательства"
	Если УчётДолговыеОбязательства Тогда
		
		ДвижениеДолги = Движения.ДолговыеОбязательства.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(ДвижениеДолги, Ссылка);
		ДвижениеДолги.Должник = Ссылка.Должник;
		ДвижениеДолги.Период = Дата;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = НачалоДня(Дата);
КонецПроцедуры
